_posts/2018-12-07-程序猿经验之谈.html
<p>
  世界月新日异，计算机技术的变化可是最有代表性，手机基本上每年都更新迭代，每隔几个月总会有让人耳目一新的新技术新体验出现，
  让人应接不暇。作为it男，看见这些炫酷的数码产品，真是馋的流口水呀。可惜囊中羞涩，根本跟没钱去买新品，一个手机都只能
  到降价平稳期才敢下手，有个两三年都不敢换。作为穷人，只能努力工作咯。
</p>

<p>
  作为互联网从业人员，在各种奇葩业务逻辑中浸淫多年，也有了点自己的小技巧。不然真会被代码折磨致死，从此失去信心，进而患上忧郁症。
  还是要抗的住压力，怼的了产品经理，脸皮够厚，体格够壮。 下面聊聊我个人的小想法
</p>

<div id="outline-container-orgaa5d84c" class="outline-3">
  <h3 id="orgaa5d84c"><span class="section-number-3">0.1</span> A</h3>
  <div class="outline-text-3" id="text-0-1">
    <div class="org-src-container">
      <pre class="src src-PHP">
$role_has_api         = app(ApiForRoleRepository::class)-&gt;get($roles_api_has_search);
        if (!$role_has_api) {
            return false;
        }

        return true;
</pre
      >
    </div>
  </div>
</div>

<div id="outline-container-org4d0f440" class="outline-3">
  <h3 id="org4d0f440"><span class="section-number-3">0.2</span> B</h3>
  <div class="outline-text-3" id="text-0-2">
    <div class="org-src-container">
      <pre class="src src-PHP">
return app(ApiForRoleRepository::class)-&gt;get($roles_api_filters);
</pre
      >
    </div>

    <p>
      以上两种写法第二种明显简洁，但是我还是偏向于使用第一种。为什么呢
      1.函数返回值尽量类型一致，这样调用的地方处理返回值比较简单，由于php为弱类型语言，可以自己在函数内进行变更
      2.B代码片段返回值依赖了被调用的函数，这样容易给人困扰，返回值是什么
      还要跟进去看 3.B代码不利于调试排错，
      A代码块在增加日志时不用对已有代码进行更改，只需增加日志代码，B代码却需要修改原始代码，增加变量来进行日志
      跟踪。 同时在使用git进行diff比较时 A 也更清晰
    </p>
  </div>
</div>

<div id="outline-container-org76f3a66" class="outline-3">
  <h3 id="org76f3a66"><span class="section-number-3">0.3</span> A</h3>
  <div class="outline-text-3" id="text-0-3">
    <div class="org-src-container">
      <pre class="src src-PHP">
if (!$project_is_open = $this-&gt;projectIsOpen($params['project_id'])) {
            return false;
        }
</pre
      >
    </div>
  </div>
</div>

<div id="outline-container-orgcf125cb" class="outline-3">
  <h3 id="orgcf125cb"><span class="section-number-3">0.4</span> B</h3>
  <div class="outline-text-3" id="text-0-4">
    <div class="org-src-container">
      <pre class="src src-PHP">
if (!$this-&gt;projectIsOpen($params['project_id'])) {
            return false;
        }
</pre
      >
    </div>

    <p>
      我更倾向于第一种，貌似化蛇添足
    </p>

    <p>
      1.同样 第一种利于增加代码进行扩展，利于排错
    </p>

    <ol class="org-ol">
      <li>尽量减少简写，这样排错的时候更加容易</li>
    </ol>

    <p>
      我对王垠大神的《编程的智慧》 中提到的观点很赞同
    </p>
  </div>
</div>

<div id="outline-container-org3a66a7d" class="outline-2">
  <h2 id="org3a66a7d"><span class="section-number-2">1</span> .反复推敲代码</h2>
  <div class="outline-text-2" id="text-1">
    <p>
      代码不是一蹴而就的，灵感是星星点点，陆陆续续到来的。所以代码需要反复提炼。每当我们过段时间回头看自己代码的时候总能发现一些改进。
      大神都这么说，作为悟性普通，能力普通的程序猿，在面对自己代码缺陷时还有什么可脸红的？
      只要能反复推敲，不断进步就是好的。最怕的是 吝啬代码，不愿意做出改变
    </p>
  </div>
</div>

<div id="outline-container-org38f721a" class="outline-2">
  <h2 id="org38f721a"><span class="section-number-2">2</span> .优雅的代码</h2>
  <div class="outline-text-2" id="text-2">
    <p>
      优雅的代码大体的结构上来看，就像一些整整齐齐，套在一起的盒子，井然有序，思路清晰.
    </p>
  </div>
</div>

<div id="outline-container-org254abe0" class="outline-2">
  <h2 id="org254abe0">
    <span class="section-number-2">3</span> .写模块化的代码
  </h2>
  <div class="outline-text-2" id="text-3"></div>
  <div id="outline-container-org6448b58" class="outline-3">
    <h3 id="org6448b58">
      <span class="section-number-3">3.1</span> 避免写太长的函数
    </h3>
    <div class="outline-text-3" id="text-3-1">
      <p>
        要能给函数的作用起个名字，如果你没有词汇能给你的函数起名字的时候，说明这个函数可能不是个好的函数，需要警惕了
      </p>
    </div>
  </div>

  <div id="outline-container-org15a4f1c" class="outline-3">
    <h3 id="org15a4f1c">
      <span class="section-number-3">3.2</span> 制造小的工具函数
    </h3>
    <div class="outline-text-3" id="text-3-2">
      <p>
        对重复常用的代码，不管有多短，都 应该提取出去做成函数。
      </p>
    </div>
  </div>

  <div id="outline-container-orgb8fc611" class="outline-3">
    <h3 id="orgb8fc611">
      <span class="section-number-3">3.3</span> 每个函数只做一件事
    </h3>
  </div>
  <div id="outline-container-orgdf63774" class="outline-3">
    <h3 id="orgdf63774">
      <span class="section-number-3">3.4</span> 避免使用全局变量和类成员
    </h3>
  </div>
</div>

<div id="outline-container-org29198b2" class="outline-2">
  <h2 id="org29198b2"><span class="section-number-2">4</span> .写可读的代码</h2>
  <div class="outline-text-2" id="text-4">
    <p>
      真正的好代码是自解释的，直接看名字就知道干的啥事
    </p>
  </div>
  <div id="outline-container-org2331953" class="outline-3">
    <h3 id="org2331953">
      <span class="section-number-3">4.1</span> 使用有意义的函数和变量名字
    </h3>
  </div>
  <div id="outline-container-orgb42d715" class="outline-3">
    <h3 id="orgb42d715">
      <span class="section-number-3">4.2</span> 局部变量应该尽量接近使用它的地方
    </h3>
  </div>
  <div id="outline-container-org94b0707" class="outline-3">
    <h3 id="org94b0707">
      <span class="section-number-3">4.3</span> 局部变量名字应该简短
    </h3>
  </div>
  <div id="outline-container-org7b9b7a1" class="outline-3">
    <h3 id="org7b9b7a1">
      <span class="section-number-3">4.4</span> 不要重用局部变量
    </h3>
    <div class="outline-text-3" id="text-4-4">
      <p>
        这样容易造成混淆，尽量减少局部变量的作用域
      </p>
    </div>
  </div>
  <div id="outline-container-orgce2873d" class="outline-3">
    <h3 id="orgce2873d">
      <span class="section-number-3">4.5</span>
      把复杂的逻辑提取出去，做出帮助函数
    </h3>
  </div>
  <div id="outline-container-org92d5bef" class="outline-3">
    <h3 id="org92d5bef">
      <span class="section-number-3">4.6</span>
      复杂的表达式提取出去，做成中间变量。
    </h3>
    <div class="outline-text-3" id="text-4-6">
      <p>
        由于中间变量具有意义，步骤清晰，变得很容易理解
      </p>
    </div>
  </div>
  <div id="outline-container-orgac9cf45" class="outline-3">
    <h3 id="orgac9cf45">
      <span class="section-number-3">4.7</span> 在合理的地方换行
    </h3>
  </div>
</div>

<div id="outline-container-orgaf50b82" class="outline-2">
  <h2 id="orgaf50b82"><span class="section-number-2">5</span> .写简单的代码</h2>
  <div class="outline-text-2" id="text-5">
    <p>
      并不是语言提供什么，就一定要用上它，只用经过千锤百炼，觉得值得信赖的一套
    </p>
  </div>
  <div id="outline-container-orgf1dbeaa" class="outline-3">
    <h3 id="orgf1dbeaa">
      <span class="section-number-3">5.1</span> 避免或减少使用自增自减表达式
    </h3>
  </div>
  <div id="outline-container-org56ee4e1" class="outline-3">
    <h3 id="org56ee4e1">
      <span class="section-number-3">5.2</span> 合理使用括号
    </h3>
    <div class="outline-text-3" id="text-5-2">
      <p>
        不要盲目依赖操作符优先级
      </p>
    </div>
  </div>
  <div id="outline-container-orgc5a9da3" class="outline-3">
    <h3 id="orgc5a9da3">
      <span class="section-number-3">5.3</span> 避免使用continue 和break
    </h3>
    <div class="outline-text-3" id="text-5-3"></div>
    <div id="outline-container-orgc4725b6" class="outline-4">
      <h4 id="orgc4725b6">
        <span class="section-number-4">5.3.1</span> 如果出现了continue
        往往只需把continue的条件反向，就可以消除continue
      </h4>
    </div>
    <div id="outline-container-org2a86bec" class="outline-4">
      <h4 id="org2a86bec">
        <span class="section-number-4">5.3.2</span> 如果出现break
        往往可以把break的条件合并到循环头部的终止条件里
      </h4>
    </div>
    <div id="outline-container-orgc16fcc5" class="outline-4">
      <h4 id="orgc16fcc5">
        <span class="section-number-4">5.3.3</span>
        有时候可以把break替换成return，从而去掉break
      </h4>
    </div>
    <div id="outline-container-org284b762" class="outline-4">
      <h4 id="org284b762">
        <span class="section-number-4">5.3.4</span>
        如果以上都失败，可以把循环里面复杂的部分提取出来，做成函数调用。
      </h4>
    </div>
  </div>
</div>
<div id="outline-container-org107921a" class="outline-2">
  <h2 id="org107921a"><span class="section-number-2">6</span> .写简单的代码</h2>
  <div class="outline-text-2" id="text-6">
    <p>
      要一眼能看出代码是想干嘛
    </p>
  </div>
</div>

<div id="outline-container-org2e2d682" class="outline-2">
  <h2 id="org2e2d682">
    <span class="section-number-2">7</span> .写无懈可击的代码
  </h2>
  <div class="outline-text-2" id="text-7">
    <p>
      不要忽略分支，不要偷懒
    </p>
  </div>
</div>

<div id="outline-container-orgb062a26" class="outline-2">
  <h2 id="orgb062a26"><span class="section-number-2">8</span> .正确处理异常</h2>
</div>
<div id="outline-container-org5a82116" class="outline-2">
  <h2 id="org5a82116">
    <span class="section-number-2">9</span> .正确处理NULL指针
  </h2>
  <div class="outline-text-2" id="text-9"></div>
  <div id="outline-container-orgc87ddee" class="outline-3">
    <h3 id="orgc87ddee">
      <span class="section-number-3">9.1</span> 尽量不要产生null指针
    </h3>
  </div>
  <div id="outline-container-org7f8190b" class="outline-3">
    <h3 id="org7f8190b">
      <span class="section-number-3">9.2</span> 不要catch NullPointerException
    </h3>
  </div>
  <div id="outline-container-orgc1189f8" class="outline-3">
    <h3 id="orgc1189f8">
      <span class="section-number-3">9.3</span> 不要把null
      放进"容器数据结构"里面
    </h3>
  </div>
</div>

<div id="outline-container-org643a8d5" class="outline-2">
  <h2 id="org643a8d5"><span class="section-number-2">10</span> 防止过度工程</h2>
  <div class="outline-text-2" id="text-10">
    <p>
      现实工程中应该看的近一点，不要被"将来"所拖垮
    </p>
  </div>
  <div id="outline-container-orgadad95b" class="outline-3">
    <h3 id="orgadad95b">
      <span class="section-number-3">10.1</span>
      先把眼前的问题解决掉，解决好，再考虑将来的扩展问题。
    </h3>
  </div>
  <div id="outline-container-orgfd183f2" class="outline-3">
    <h3 id="orgfd183f2">
      <span class="section-number-3">10.2</span>
      先写出可用的代码，反复推敲，再考虑是否需要重用的问题。
    </h3>
  </div>
  <div id="outline-container-org519d9dc" class="outline-3">
    <h3 id="org519d9dc">
      <span class="section-number-3">10.3</span>
      先写出可用，简单，明显没有bug的代码，再考虑测试的问题。
    </h3>
  </div>
</div>
